app/controllers/gyms_controller.rb

SELECT "gyms".* FROM "gyms"
---
    def index
        @gyms = Gym.all