app/controllers/trainers_controller.rb

SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @trainers = Trainer.find(params[:id])